Added outputs and variables for aws_check_stack. The script runs as below,

```
krishna@turbotindias-MacBook-Pro aws_check_stack % terraform apply
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.aws_account_iam_stack[0] will be created
  + resource "turbot_policy_setting" "aws_account_iam_stack" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws#/policy/types/accountStack"
      + value                        = "Check: Configured"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_account_iam_stack_source[0] will be created
  + resource "turbot_policy_setting" "aws_account_iam_stack_source" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws#/policy/types/accountStackSource"
      + value                        = <<~EOT
            resource "aws_iam_role" "example_role" {
              name               = "example_role"
              assume_role_policy = <<-EOF
                {
                  "Version": "2012-10-17",
                  "Statement": [
                    {
                      "Effect": "Allow",
                      "Principal": {
                        "AWS": "arn:aws:iam::287590803701:root"
                      },
                      "Action": "sts:AssumeRole",
                      "Condition": {
                        "StringEquals": {
                          "sts:ExternalId": "12345678"
                        }
                      }
                    }
                  ]
                }
                EOF
            }
            
            resource "aws_iam_policy" "example_policy" {
              name   = "example_policy"
              policy = <<-EOF
                {
                  "Version": "2012-10-17",
                  "Statement": [
                    {
                      "Action": [
                        "logs:CreateLogGroup",
                        "logs:CreateLogStream",
                        "logs:DescribeLogGroups",
                        "logs:DescribeLogStreams"
                      ],
                      "Effect": "Allow",
                      "Resource": "*"
                    }
                  ]
                }
                EOF
            }
            
            resource "aws_iam_role_policy_attachment" "example_role_policy_attach" {
              role       = aws_iam_role.example_role.name
              policy_arn = aws_iam_policy.example_policy.arn
            }
            
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_account_iam_stack_tfversion[0] will be created
  + resource "turbot_policy_setting" "aws_account_iam_stack_tfversion" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws#/policy/types/accountStackTerraformVersion"
      + value                        = "0.13.*"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_permissions_custom_levels_account[0] will be created
  + resource "turbot_policy_setting" "aws_iam_permissions_custom_levels_account" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/permissionsCustomLevelsAccount"
      + value                        = <<~EOT
            - example-role
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_stack will be created
  + resource "turbot_smart_folder" "aws_stack" {
      + description = "Defines sets of policies for the AWS Stack baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Stack Example Policies"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_stack: Creating...
turbot_smart_folder.aws_stack: Creation complete after 2s [id=216806537763670]
turbot_policy_setting.aws_account_iam_stack[0]: Creating...
turbot_policy_setting.aws_account_iam_stack_source[0]: Creating...
turbot_policy_setting.aws_account_iam_stack_tfversion[0]: Creating...
turbot_policy_setting.aws_iam_permissions_custom_levels_account[0]: Creating...
turbot_policy_setting.aws_account_iam_stack[0]: Creation complete after 3s [id=216806540975971]
turbot_policy_setting.aws_account_iam_stack_tfversion[0]: Creation complete after 4s [id=216806540975972]
turbot_policy_setting.aws_iam_permissions_custom_levels_account[0]: Creation complete after 4s [id=216806542913396]
turbot_policy_setting.aws_account_iam_stack_source[0]: Creation complete after 4s [id=216806542901103]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

aws_account_iam_stack = true
aws_account_iam_stack_source = true
aws_account_iam_stack_tfversion = true
aws_iam_permissions_custom_levels_account = true
smart_folder_description = Defines sets of policies for the AWS Stack baseline
smart_folder_name = AWS Stack Example Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher